Hey @lawrencegripper i had to set up a personal account to test this as on our company azure tenant our SPs do not have privileges to do your recommended changes. But after testing it on my personal account I was not able to reproduce this issue:

```hcl
variable "client_id" {
  type = string
}
variable "client_secret" {
  type = string
}
variable "tenant_id" {
  type = string
}
variable "subscription_id" {
  type = string
}
variable "token" {
  type = string
}
variable "host" {
  type = string
}
variable "resource_group" {
  type = string
}
variable "managed_resource_group_name" {
  type = string
}

provider "azurerm" {
  client_id = var.client_id
  client_secret = var.client_secret
  tenant_id = var.tenant_id
  subscription_id = var.subscription_id
  features {}
}

resource "azurerm_resource_group" "db" {
  name = "db-labs-resources"
  location = "centralus"
}

resource "azurerm_databricks_workspace" "demo_test_workspace" {
  location = "centralus"
  name = "terraform-test-ws-6"
  resource_group_name = azurerm_resource_group.db.name
//  resource_group_name = var.resource_group
  managed_resource_group_name = var.managed_resource_group_name
  sku = "premium"
}



provider "databricks" {
  azure_auth = {
    managed_resource_group = azurerm_databricks_workspace.demo_test_workspace.managed_resource_group_name
    azure_region = azurerm_databricks_workspace.demo_test_workspace.location
    workspace_name = azurerm_databricks_workspace.demo_test_workspace.name
    resource_group = azurerm_databricks_workspace.demo_test_workspace.resource_group_name
    client_id = var.client_id
    client_secret = var.client_secret
    tenant_id = var.tenant_id
    subscription_id = var.subscription_id
  }
}

resource "databricks_secret_scope" "my-scope" {
  name = "terraform-demo-scope2"
}
```

Output:

```
terraform apply

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # azurerm_databricks_workspace.demo_test_workspace will be created
  + resource "azurerm_databricks_workspace" "demo_test_workspace" {
      + id                          = (known after apply)
      + location                    = "centralus"
      + managed_resource_group_id   = (known after apply)
      + managed_resource_group_name = "databricks-rg-1-sri-terraform-test-sri-terraform-test-ws-6"
      + name                        = "terraform-test-ws-6"
      + resource_group_name         = "db-labs-resources"
      + sku                         = "premium"
      + workspace_id                = (known after apply)
      + workspace_url               = (known after apply)

      + custom_parameters {
          + no_public_ip        = (known after apply)
          + private_subnet_name = (known after apply)
          + public_subnet_name  = (known after apply)
          + virtual_network_id  = (known after apply)
        }
    }

  # azurerm_resource_group.db will be created
  + resource "azurerm_resource_group" "db" {
      + id       = (known after apply)
      + location = "centralus"
      + name     = "db-labs-resources"
    }

  # databricks_secret_scope.my-scope will be created
  + resource "databricks_secret_scope" "my-scope" {
      + backend_type             = (known after apply)
      + id                       = (known after apply)
      + initial_manage_principal = "users"
      + name                     = "terraform-demo-scope2"
    }

  # databricks_token.my-token will be created
  + resource "databricks_token" "my-token" {
      + comment          = "Testing terraform v2"
      + creation_time    = (known after apply)
      + expiry_time      = (known after apply)
      + id               = (known after apply)
      + lifetime_seconds = 6000
      + token_value      = (sensitive value)
    }

Plan: 4 to add, 0 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

azurerm_resource_group.db: Creating...
azurerm_resource_group.db: Creation complete after 1s [id=/subscriptions/<sub-id>/resourceGroups/db-labs-resources]
azurerm_databricks_workspace.demo_test_workspace: Creating...
azurerm_databricks_workspace.demo_test_workspace: Still creating... [10s elapsed]
azurerm_databricks_workspace.demo_test_workspace: Still creating... [20s elapsed]
azurerm_databricks_workspace.demo_test_workspace: Still creating... [30s elapsed]
azurerm_databricks_workspace.demo_test_workspace: Still creating... [40s elapsed]
azurerm_databricks_workspace.demo_test_workspace: Still creating... [50s elapsed]
azurerm_databricks_workspace.demo_test_workspace: Still creating... [1m0s elapsed]
azurerm_databricks_workspace.demo_test_workspace: Still creating... [1m10s elapsed]
azurerm_databricks_workspace.demo_test_workspace: Still creating... [1m20s elapsed]
azurerm_databricks_workspace.demo_test_workspace: Still creating... [1m30s elapsed]
azurerm_databricks_workspace.demo_test_workspace: Still creating... [1m40s elapsed]
azurerm_databricks_workspace.demo_test_workspace: Still creating... [1m50s elapsed]
azurerm_databricks_workspace.demo_test_workspace: Still creating... [2m0s elapsed]
azurerm_databricks_workspace.demo_test_workspace: Still creating... [2m10s elapsed]
azurerm_databricks_workspace.demo_test_workspace: Still creating... [2m20s elapsed]
azurerm_databricks_workspace.demo_test_workspace: Still creating... [2m30s elapsed]
azurerm_databricks_workspace.demo_test_workspace: Still creating... [2m40s elapsed]
azurerm_databricks_workspace.demo_test_workspace: Still creating... [2m50s elapsed]
azurerm_databricks_workspace.demo_test_workspace: Still creating... [3m0s elapsed]
azurerm_databricks_workspace.demo_test_workspace: Creation complete after 3m3s [id=/subscriptions/<sub-id>/resourceGroups/db-labs-resources/providers/Microsoft.Databricks/workspaces/terraform-test-ws-6]
databricks_token.my-token: Creating...
databricks_secret_scope.my-scope: Creating...
databricks_token.my-token: Creation complete after 7s [id=3184db0cdbebe10eef940ac668ced99d679dee028c87a42c6e4d5164a3cd3c7d]
databricks_secret_scope.my-scope: Still creating... [10s elapsed]
databricks_secret_scope.my-scope: Creation complete after 18s [id=terraform-demo-scope2]
```

Hey @EliiseS regarding the second item with the:

Currently the way the provider configure implementation and the client work is that the azure auth component will be configured to a function variable on the client config called CustomAuthorizer. During an api call from the provider for the CRUD actions it will invoke this function as the api call is performed:

```go
// client.g
func (c *DBApiClientConfig) getOrCreateToken() error {
	if c.CustomAuthorizer != nil {
		// Lock incase terraform tries to getOrCreateToken from multiple go routines on the same client ptr.
		clientAuthorizerMutex.Lock()
		defer clientAuthorizerMutex.Unlock()
		if reflect.ValueOf(c.Token).IsZero() {
			log.Println("NOT AUTHORIZED SO ATTEMPTING TO AUTHORIZE")
			return c.CustomAuthorizer(c)
		}
		log.Println("ALREADY AUTHORIZED")
		return nil
	}
	return nil
}
```
```go
// apis.go
func (c *DBApiClient) performQuery(method, path string, apiVersion string, headers map[string]string, data interface{}, secretsMask *SecretsMask) ([]byte, error) {
	err := c.Config.getOrCreateToken()
	if err != nil {
		return []byte(""), err
	}
...
}
```

So I was suggesting that the test I recommend above is incomplete and we should also verify that the CustomAuthorizer attribute in the config is not nil. 

```go
func TestProvider_AzureAuthDoesNotResultInError(t *testing.T) {
	var raw = make(map[string]interface{})
	var azureAuth = make(map[string]interface{})
	azureAuth["managed_resource_group"] = "test"
	azureAuth["azure_region"] = "test"
	azureAuth["workspace_name"] = "test"
	azureAuth["resource_group"] = "test"
	azureAuth["subscription_id"] = "test"
	azureAuth["client_secret"] = "test"
	azureAuth["client_id"] = "test"
	azureAuth["tenant_id"] = "test"
	raw["azure_auth"] = azureAuth

	err := testAccProvider.Configure(terraform.NewResourceConfigRaw(raw))
	assert.Nil(t, err)
	clientMeta := testAccProvider.Meta()
	assert.NotNil(t, clientMeta, "Provider meta is nil")
	config := testAccProvider.Meta().(*service.DBApiClient).Config
	assert.NotNil(t, config.CustomAuthorizer, "Config custom authorizer should not be kept as nil.")
}
```